# მომხმარებელს შემოაყვანინეთ რიცხვი. თუ ის ლუწია გამოიტანეთ სიტყვა "ლუწი", ხოლო თუ კენტია გამოიტანეთ "კენტი". 

num = int(input("შეიყვანეთ რიცხვი: "))
if num / 2 == int(num / 2):
    print("ლუწი")
if num / 2 != int(num / 2):
    print("კენტი")


#2  შეამოწმეთ მომხმარებლის შემოყვანილი რიცხვი ნეგატიურია პოზიტიურია თუ 0-ია. ამის მიხედვით გაუტოლეთ ცვლად res 0, -1 ან 1. 

num1 = int(input("შეიყვანეთ რიცხვი: "))
num = 0
if num1 < 0:
    num = -1
if num1 > 0:
    num = 1
if num1 == 0:
    num = 0
print(num)

#3 მომხმარებლს შემოატანინეთ 2 რიცხვი და გამოიტანეთ უდიდესი ტერმინალში.

num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))
if num1 >= num2:
    print("უდიდესი რიცხვი:", num1)
if num2 > num1:
    print("უდიდესი რიცხვი:", num2)

 #4   
num = int(input("შეიყვანეთ რიცხვი: "))
if num / 5 == int(num / 5):
    print(num)
else:
    print(0)



