# შეიყვანეთ ოთხი რიცხვი

num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
num3 = float(input("შეიყვანეთ მესამე რიცხვი: "))
num4 = float(input("შეიყვანეთ მეოთხე რიცხვი: "))

#საშუალო არითმეტიკული

num = (num1 + num2 + num3 + num4) / 4
print(num)

# მომხმარებელს შემოატანინეთ სახელი და გვარი, შემდეგ გამოპრინტეთ ტექსტი: „მოგესალმები, [სახელი] [გვარი]!“

name = input("სახელი")
surname = input("გვარი")
full_name = name + " " + surname

print("მოგესალმები, " + full_name + "!")

# მომხმარებელს შემოატანინეთ ორი რიცხვი და გამოიტანეთ მათი სტრინგებად გაერთიანებული ვერსია, რომლის შუაშიც იქნება "😊" ემოჯი.

num3 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num4 = float(input("შეიყვანეთ მეორე რიცხვი: "))

num5 = str(num3) + "😊" + str(num4)

print(num5)