#1. შექმენით პროგრამა სადაც მომხმარებელი შემოიყვანს ასაკს და თქვენ უნდა გაარკვიოთ, უნდა იაროს მან ბაღში, სკოლაში თუ სამსახურში: თუ ასაკი მეტი იქნება 2-ზე == ბაღი | თუ ასაკი მეტია ან უდრის 6-ს == სკოლაში | დანარჩენ შემთხვევაში სამსახური. 

age = int(input("შეიყვანეთ თქვენი ასაკი: "))

if age <= 2:
    print("ბაღი")
if age > 2 and age <= 6:
    print("სკოლა")
if age > 6:
    print("სამსახური")


#2. შექმენით პროგრამა რომელშიც: მომხმარებელს შემოყავს ინფორმაცია თუ რომელ პროგრამირების  აკადემიაში დადის, თუ მან შეიყვანა "Goa", გამოიტანეთ "U r a real chad!", ხოლო დანარჩენ შემთხვევაში "Join Goa, become a chad". 

academy = input("შეიყვანეთ, რომელ პროგრამირების აკადემიაში დადიხართ: ")

if academy == "Goa":
    print("U r a real chad!")
if academy != "Goa":
    print("Join Goa, become a chad")

#3. მომხმარებელს შემოყავს პროექტში მიღებული ქულის შესახებ, თუ ის 90-ზე მეტია შეფასებაა A, თუ 75-ზე მეტია შეფასებაა B, თუ 60-ზე მეტია შეფასებაა C, თუ 50-ზე მეტია შეფასებაა D, თუ 40-ზე E და თუ 30-ზე F, Good Luck💚 

score = int(input("შეიყვანეთ თქვენი პროექტის ქულა: "))

if score > 90:
    print("A")
if score > 75 and score <= 90:
    print("B")
if score > 60 and score <= 75:
    print("C")
if score > 50 and score <= 60:
    print("D")
if score > 40 and score <= 50:
    print("E")
if score <= 40:
    print("F")


